app/views/feeds/index.html.erb

SELECT COUNT(*) FROM "reminders" WHERE "reminders"."user_id" = ?  [[nil, 1]]
---
     <div>
           <% if current_user.reminders.size ==0 %>

SELECT COUNT(*) FROM "feeds" WHERE "feeds"."user_id" = ?  [[nil, 1]]
---
    <div>
    <% if current_user.feeds.size ==0 %>