app/views/registers/index.html.erb

<h1>My Pets</h1>
 <% if current_user.registers.size==0 %>
---
SELECT "registers".* FROM "registers" WHERE "registers"."user_id" = ?  [[nil, 1]]
SELECT COUNT(*) FROM "registers" WHERE "registers"."user_id" = ?  [[nil, 1]]