app/views/devices/index.html.erb


        <td><%= device.User.first_name %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]