app/views/devices/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  <strong>User:</strong>
  <%= @device.User.first_name %>