app/controllers/devices_controller.rb

  def register2
    @device = Device.where(:id => params[:text2].to_i).first
    @device.User_id = current_user.id
    @device.Register =  Register.where(:id => params[:text3].to_i).first


     if !(@device.User.blank?) then
    respond_to do |format|
      if @device.save then
---
SELECT  "devices".* FROM "devices" WHERE "devices"."id" = ?  ORDER BY "devices"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "registers".* FROM "registers" WHERE "registers"."id" = ?  ORDER BY "registers"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
UPDATE "devices" SET "User_id" = ?, "Register_id" = ?, "updated_at" = ? WHERE "devices"."id" = ?  [["User_id", 1], ["Register_id", 1], ["updated_at", "2015-04-09 01:34:46.413514"], ["id", 1]]

  def destroy
    @device.User = nil
    @device.Register = nil
    @device.save
---
UPDATE "devices" SET "User_id" = ?, "Register_id" = ?, "updated_at" = ? WHERE "devices"."id" = ?  [["User_id", nil], ["Register_id", nil], ["updated_at", "2015-04-09 01:36:32.523583"], ["id", 1]]