app/controllers/registers_controller.rb

	def show
    @register = Register.find(params[:id])
---
SELECT  "registers".* FROM "registers" WHERE "registers"."id" = ? LIMIT 1  [["id", 0]]

  def index
    @reg= Register.new
    @register = current_user.registers
    #Here im creating an array of pets to be showed to the current user who is considered to be a buddy that have access on these pets.

    @registers = []
    @buddies = Buddy.where(:user => current_user)
    @buddies.each do |buddy|
    if !@register.include?(buddy.register)
---
SELECT "buddies".* FROM "buddies" WHERE "buddies"."user_id" = 1
SELECT  1 AS one FROM "registers" WHERE "registers"."user_id" = ? LIMIT 1  [[nil, 2]]
SELECT "registers".* FROM "registers" WHERE "registers"."user_id" = ?  [[nil, 1]]

  def create
  @register = Register.new(register_params)
  @register.User = current_user

  if @register.save
---
INSERT INTO "registers" ("name", "breed", "gender", "species", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "date_of_birth", "User_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)